HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxOvc_reg.h
/** \\brief  30, Overlay Mask Register */
#define OVC1_BLK2_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB30u)

/** Alias (User Manual Name) for OVC1_BLK2_OMASK.
* To use register names with standard convension, please use OVC1_BLK2_OMASK.
*/
#define	OVC1_OMASK2	(OVC1_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC1_BLK2_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB2Cu)

/** Alias (User Manual Name) for OVC1_BLK2_OTAR.
* To use register names with standard convension, please use OVC1_BLK2_OTAR.
*/
#define	OVC1_OTAR2	(OVC1_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC1_BLK2_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB28u)

/** Alias (User Manual Name) for OVC1_BLK2_RABR.
* To use register names with standard convension, please use OVC1_BLK2_RABR.
*/
#define	OVC1_RABR2	(OVC1_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC1_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC80u)

/** Alias (User Manual Name) for OVC1_BLK30_OMASK.
* To use register names with standard convension, please use OVC1_BLK30_OMASK.
*/
#define	OVC1_OMASK30	(OVC1_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC1_BLK30_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC7Cu)

/** Alias (User Manual Name) for OVC1_BLK30_OTAR.
* To use register names with standard convension, please use OVC1_BLK30_OTAR.
*/
#define	OVC1_OTAR30	(OVC1_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC1_BLK30_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC78u)

/** Alias (User Manual Name) for OVC1_BLK30_RABR.
* To use register names with standard convension, please use OVC1_BLK30_RABR.
*/
#define	OVC1_RABR30	(OVC1_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC1_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC8Cu)

/** Alias (User Manual Name) for OVC1_BLK31_OMASK.
* To use register names with standard convension, please use OVC1_BLK31_OMASK.
*/
#define	OVC1_OMASK31	(OVC1_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC1_BLK31_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC88u)

/** Alias (User Manual Name) for OVC1_BLK31_OTAR.
* To use register names with standard convension, please use OVC1_BLK31_OTAR.
*/
#define	OVC1_OTAR31	(OVC1_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC1_BLK31_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC84u)

/** Alias (User Manual Name) for OVC1_BLK31_RABR.
* To use register names with standard convension, please use OVC1_BLK31_RABR.
*/
#define	OVC1_RABR31	(OVC1_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC1_BLK3_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB3Cu)

/** Alias (User Manual Name) for OVC1_BLK3_OMASK.
* To use register names with standard convension, please use OVC1_BLK3_OMASK.
*/
#define	OVC1_OMASK3	(OVC1_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC1_BLK3_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB38u)

/** Alias (User Manual Name) for OVC1_BLK3_OTAR.
* To use register names with standard convension, please use OVC1_BLK3_OTAR.
*/
#define	OVC1_OTAR3	(OVC1_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC1_BLK3_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB34u)

/** Alias (User Manual Name) for OVC1_BLK3_RABR.
* To use register names with standard convension, please use OVC1_BLK3_RABR.
*/
#define	OVC1_RABR3	(OVC1_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC1_BLK4_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB48u)

/** Alias (User Manual Name) for OVC1_BLK4_OMASK.
* To use register names with standard convension, please use OVC1_BLK4_OMASK.
*/
#define	OVC1_OMASK4	(OVC1_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC1_BLK4_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB44u)

/** Alias (User Manual Name) for OVC1_BLK4_OTAR.
* To use register names with standard convension, please use OVC1_BLK4_OTAR.
*/
#define	OVC1_OTAR4	(OVC1_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC1_BLK4_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB40u)

/** Alias (User Manual Name) for OVC1_BLK4_RABR.
* To use register names with standard convension, please use OVC1_BLK4_RABR.
*/
#define	OVC1_RABR4	(OVC1_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC1_BLK5_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB54u)

/** Alias (User Manual Name) for OVC1_BLK5_OMASK.
* To use register names with standard convension, please use OVC1_BLK5_OMASK.
*/
#define	OVC1_OMASK5	(OVC1_BLK5_OMASK)

/** \\brief  50, Overlay Target Address Register */
#define OVC1_BLK5_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB50u)

/** Alias (User Manual Name) for OVC1_BLK5_OTAR.
* To use register names with standard convension, please use OVC1_BLK5_OTAR.
*/
#define	OVC1_OTAR5	(OVC1_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC1_BLK5_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB4Cu)

/** Alias (User Manual Name) for OVC1_BLK5_RABR.
* To use register names with standard convension, please use OVC1_BLK5_RABR.
*/
#define	OVC1_RABR5	(OVC1_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC1_BLK6_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB60u)

/** Alias (User Manual Name) for OVC1_BLK6_OMASK.
* To use register names with standard convension, please use OVC1_BLK6_OMASK.
*/
#define	OVC1_OMASK6	(OVC1_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC1_BLK6_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB5Cu)

/** Alias (User Manual Name) for OVC1_BLK6_OTAR.
* To use register names with standard convension, please use OVC1_BLK6_OTAR.
*/
#define	OVC1_OTAR6	(OVC1_BLK6_OTAR)

